# Pandas is very important library for Data Analisys.
## Learning Pandas is Both Exiting and Fun

In [4]:
import pandas

### Loading the wanted csv

csv = pandas.read_csv('creds.csv')

In [6]:
csv

      f_name        l_name  roll_no      div  age
0  Chaitanya     Jaipurkar       34   Dahlia   13
1        Adi          Rane       11        A   11
2     Adwait          Dive       56    Pluto   12
3    Vishrut  Vaishampayan       48   Dahlia   13
4       Neel      Deshmukh       29  Jasmine   10
5    Samarth         Joshi       33      jas   11

### Now we are maping the changed column name to the real names, just like a dictionary

In [7]:
csv.rename(columns={'f_name' : 'First_Name','l_name' : 'Last_Name','roll_no' : 'Roll_No'})

  First_Name     Last_Name  Roll_No      div  age
0  Chaitanya     Jaipurkar       34   Dahlia   13
1        Adi          Rane       11        A   11
2     Adwait          Dive       56    Pluto   12
3    Vishrut  Vaishampayan       48   Dahlia   13
4       Neel      Deshmukh       29  Jasmine   10
5    Samarth         Joshi       33      jas   11

### The Changes are visible!!

#### Now if we want the changes to be permanent the we will have to change the value of the key-word argument 'inplace' to True

In [8]:
csv.rename(columns={'f_name' : 'First_Name','l_name' : 'Last_Name','roll_no' : 'Roll_No'},inplace=True)

### Ok now lets change the values in the rows !

In [11]:
csv.loc[1,['First_Name','div']] = ['Aditya','Aster']

In [12]:
csv

  First_Name     Last_Name  Roll_No      div  age
0  Chaitanya     Jaipurkar       34   Dahlia   13
1     Aditya          Rane       11    Aster   11
2     Adwait          Dive       56    Pluto   12
3    Vishrut  Vaishampayan       48   Dahlia   13
4       Neel      Deshmukh       29  Jasmine   10
5    Samarth         Joshi       33      jas   11

### See we can see the changed values

#### Now let us change a full column in one go to 'uppercase'

In [13]:
csv['First_Name'] = csv['First_Name'].str.upper()

In [14]:
csv

  First_Name     Last_Name  Roll_No      div  age
0  CHAITANYA     Jaipurkar       34   Dahlia   13
1     ADITYA          Rane       11    Aster   11
2     ADWAIT          Dive       56    Pluto   12
3    VISHRUT  Vaishampayan       48   Dahlia   13
4       NEEL      Deshmukh       29  Jasmine   10
5    SAMARTH         Joshi       33      jas   11

### Now there is a method called apply which applies a specefic funcion o every value of a column

In [15]:
csv['div'] = csv['div'].apply(lambda z : z.upper())

In [16]:
csv

  First_Name     Last_Name  Roll_No      div  age
0  CHAITANYA     Jaipurkar       34   DAHLIA   13
1     ADITYA          Rane       11    ASTER   11
2     ADWAIT          Dive       56    PLUTO   12
3    VISHRUT  Vaishampayan       48   DAHLIA   13
4       NEEL      Deshmukh       29  JASMINE   10
5    SAMARTH         Joshi       33      JAS   11

##### We can either pass a lambda function or a normal function
##### Now we can see that the values in the column 'div' are all uppercase!